In [5]:
import pandas as pd

In [6]:
df = pd.read_csv('https://www.dropbox.com/s/vnkhtwm4m67khqb/demographic_data.csv?dl=1')

In [9]:
df.head(10)

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9000,High income
1,Afghanistan,AFG,35.253,5.9000,Low income
2,Angola,AGO,45.985,19.1000,Upper middle income
3,Albania,ALB,12.877,57.2000,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0000,High income
5,Argentina,ARG,17.716,59.9000,High income
6,Armenia,ARM,13.308,41.9000,Lower middle income
7,Antigua and Barbuda,ATG,16.447,63.4000,High income
8,Australia,AUS,13.200,83.0000,High income
9,Austria,AUT,9.400,80.6188,High income

In [10]:
df.sample(5)

,Country Name,Country Code,Birth rate,Internet users,Income Group
37,Colombia,COL,16.076,51.7,Upper middle income
7,Antigua and Barbuda,ATG,16.447,63.4,High income
164,Swaziland,SWZ,30.093,24.7,Lower middle income
33,China,CHN,12.100,45.8,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [12]:
df.shape

(195, 5)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country Name    195 non-null    object
 1   Country Code    195 non-null    object
 2   Birth rate      195 non-null    float64
 3   Internet users  195 non-null    float64
 4   Income Group    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [14]:
df.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country Name    195 non-null    object
 1   Country Code    195 non-null    object
 2   Birth rate      195 non-null    float64
 3   Internet users  195 non-null    float64
 4   Income Group    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [15]:
df.describe()

       Birth rate  Internet users
count  195.000000      195.000000
mean    21.469928       42.076471
std     10.605467       29.030788
min      7.900000        0.900000
25%     12.120500       14.520000
50%     19.680000       41.000000
75%     29.759500       66.225000
max     49.661000       96.546800

In [16]:
df.describe(include='all')

       Country Name Country Code  Birth rate  Internet users Income Group
count           195          195  195.000000      195.000000          195
unique          195          195         NaN             NaN            4
top           Aruba          ABW         NaN             NaN  High income
freq              1            1         NaN             NaN           67
mean            NaN          NaN   21.469928       42.076471          NaN
std             NaN          NaN   10.605467       29.030788          NaN
min             NaN          NaN    7.900000        0.900000          NaN
25%             NaN          NaN   12.120500       14.520000          NaN
50%             NaN          NaN   19.680000       41.000000          NaN
75%             NaN          NaN   29.759500       66.225000          NaN
max             NaN          NaN   49.661000       96.546800          NaN

In [17]:
df.columns

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')